robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
    /*
    static int KiErrIntH=0,KiErrIntL=0;

    int Err;

    if (encoder_dhes_state_stored != encoder_dhes_state)
    {
        encoder_dhes_state_stored  = encoder_dhes_state;

        KiErrIntH=KiErrIntL=0;

        switch (encoder_dhes_state)
        {
        case 0b001: // Sector 1: (0,0,1)   60-120 degrees
            piH=&(ParkParm.qIa); piL=&(ParkParm.qIb); 
            ppwmH=&PDC1; ppwmL=&PDC2; ppwm0=&PDC3; break;

        case 0b011: // Sector 2: (0,1,1)  120-180 degrees
            piH=&(ParkParm.qIa); piL=&(ParkParm.qIc);
            ppwmH=&PDC1; ppwm0=&PDC2; ppwmL=&PDC3; break;

        case 0b010: // Sector 3: (0,1,0)  180-240 degrees
            piH=&(ParkParm.qIb); piL=&(ParkParm.qIc);
            ppwm0=&PDC1; ppwmH=&PDC2; ppwmL=&PDC3; break;

        case 0b110: // Sector 4: (1,1,0)  240-300 degrees
            piH=&(ParkParm.qIb); piL=&(ParkParm.qIa);
            ppwmL=&PDC1; ppwmH=&PDC2; ppwm0=&PDC3; break;

        case 0b100: // Sector 5: (1,0,0)  300-360 degrees
            piH=&(ParkParm.qIc); piL=&(ParkParm.qIa);
            ppwmL=&PDC1; ppwm0=&PDC2; ppwmH=&PDC3; break;

        case 0b101: // Sector 6: (1,0,1)    0- 60 degrees
            piH=&(ParkParm.qIc); piL=&(ParkParm.qIb);
            ppwm0=&PDC1; ppwmL=&PDC2; ppwmH=&PDC3; break;
        }

        iHfilt = *piH;
        iLfilt = *piL;
    }

    //////////////////////////////////////////////////////

    iHfilt += *piH;
    iHfilt >>= 1;

    Err = CtrlReferences.qIqRef - iHfilt;

    pwmH = __builtin_mulss(CurrentQPID.IDPMCoefficients[2], Err) >> (16+KSHIFT_Q_P);

    KiErrIntH += __builtin_mulss(CurrentQPID.IDPMCoefficients[0], Err) >> 8;

    if (KiErrIntH > CurrentQPID.IDPMCoefficients[3])
    {
        KiErrIntH = CurrentQPID.IDPMCoefficients[3];        
    }
    else if (KiErrIntH < -CurrentQPID.IDPMCoefficients[3])
    {
       KiErrIntH = -CurrentQPID.IDPMCoefficients[3];        
    }
      
    pwmH += KiErrIntH >> 8;

    if (pwmH>125) pwmH=125; else if (pwmH<-125) pwmH=-125;

    //////////////////////////////////////////////////////

    iLfilt += *piL;
    iLfilt >>= 1;

    Err = CtrlReferences.qIqRef + iLfilt;

    pwmL = __builtin_mulss(CurrentQPID.IDPMCoefficients[2], Err) >> (16+KSHIFT_Q_P);

    KiErrIntL += __builtin_mulss(CurrentQPID.IDPMCoefficients[0], Err) >> 8;

    if (KiErrIntL > CurrentQPID.IDPMCoefficients[3])
    {
        KiErrIntL = CurrentQPID.IDPMCoefficients[3];        
    }
    else if (KiErrIntL < -CurrentQPID.IDPMCoefficients[3])
    {
        KiErrIntL = -CurrentQPID.IDPMCoefficients[3];        
    }
      
    pwmL += KiErrIntL >> 8;

    if (pwmL>125) pwmL=125; else if (pwmL<-125) pwmL=-125;
    */
  }
  else
  {
      pwm1 = pwm3 = 0;
  }

  // if we are close enough to the PCD register shadow copy then wait until
  // its done before updating local PDCs
  // The condition will became false when the PWM is counting down but it is still
  // far from 0 or when it change direction counting up

  // reset the flag that indicates if the PWM registers update was delayed
  pwmdelay = 0;

  // reset timeout counter that is used to wait for the PWM registers update
  timeout = PWMSAFETIME;

  //     PWM count DN               PWM count < PWM_SAFE_TIME
  while((P1TMR & 0x8000) && ((P1TMR & 0x7fff) < PWMSAFETIME))
  {
      pwmdelay = 1;

      if(0==timeout--)
      {
        SysError.FirmwarePWMFatalError = 1;
        //FaultConditionsHandler();
        break;
      }
  }

  if(pwmdelay)
  {
    // if the PWM PDC update has been delayed, then increment
    // the counter that keeps track of this event, but be
    // careful not to overflow it
    if (FirmwarePWMTimingErrorCount < 0xff)
    {
        FirmwarePWMTimingErrorCount++;
    }
  }

  PDC1 = pwm_half+pwm1;
  PDC2 = pwm_half;
  PDC3 = pwm_half+pwm3;
 
  // when gulp_update_request is == 1, the main loop will not access those vars. 
  if(1 == gulp_update_request)
  {  
    // GULP!ed variables
    Gulp.W[0] = *gulpadr1;
    Gulp.W[1] = *gulpadr2;
    Gulp.W[2] = *gulpadr3;
    Gulp.W[3] = *gulpadr4;
    
    // unlock the main loop, so it will read values just updated
    gulp_update_request = 0;

    // read VDC link raw value;
    VDCLink = ADCGetVDCLink();
    debug_i2t = I2Tdata.Acc[1];
  }

  // perform I2T protection from ParkParm.qId,qIq 
  //I2Tdata.IQMeasured = /*abs*/(ParkParm.qIq);
  //I2Tdata.IDMeasured = /*abs*/(ParkParm.qId);

  I2Tdata.IQMeasured = I2Tdata.IDMeasured = ParkParm.qIa;
  I2Tdata.IQMeasured += ParkParm.qIb;
  I2Tdata.IQMeasured += ParkParm.qIb;
  I2Tdata.IQMeasured *= 10;
  I2Tdata.IQMeasured >>= 4;

  // Invoke the I2T integrator with new current values
  if(I2T(&I2Tdata))
  {
    //The I2T grew too much. Protect!
    SysError.I2TFailure = 1;
    FaultConditionsHandler();
  }

  //Clear the DMA0 Interrupt Flag
  IFS0bits.DMA0IF = 0;
}

#elif defined ENCODER_DHES

// DMA0 IRQ Service Routine used for FOC loop
void __attribute__((__interrupt__,no_auto_psv)) _DMA0Interrupt(void)
{
  extern tPID2 CurrentQPID;

  static int pwm_half=500;

  static int encoder_dhes_state_stored = 0;
  static int *ppwmH=NULL,*ppwmL=NULL,*ppwm0=NULL;
  static int *piH=NULL,*piL=NULL;
  static int iHfilt=0,iLfilt=0;

  int pwmH,pwmL;

  int pwmdelay = 0;
  int timeout;

  // setting CORCON in this way rather than using CORCONbits is
  // slightly more efficient (because CORCONbits is volatile and
  // optimizer cannot collapse multiple bit operations)
    
  CORCON = 0b11110100;

  // read Meccanical postion [-1..0.9999] and angle corrected with encsyncpulsepos
  // calculate AlignedMecchanicalAngle and UnalignedMecchanicalAngle from raw encoder data 
  EncoderPosition();

  // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb, Offsetc
  // scale currents by MeasCurrParm.qKa, qKb, qKc
  // Calculate ParkParm.qIa, qIb, qIc
  MeasAndCompIaIcCalculateIb();

  if (SysStatus.OpenLoop)
  {
    if (encoder_dhes_state_stored != encoder_dhes_state)
    {
        encoder_dhes_state_stored  = encoder_dhes_state;

        switch (encoder_dhes_state)
        {
        case 0b001: // Sector 1: (0,0,1)   60-120 degrees
            ppwmH=(int*)&PDC1; ppwmL=(int*)&PDC2; ppwm0=(int*)&PDC3; break;

        case 0b011: // Sector 2: (0,1,1)  120-180 degrees
            ppwmH=(int*)&PDC1; ppwm0=(int*)&PDC2; ppwmL=(int*)&PDC3; break;

        case 0b010: // Sector 3: (0,1,0)  180-240 degrees
            ppwm0=(int*)&PDC1; ppwmH=(int*)&PDC2; ppwmL=(int*)&PDC3; break;

        case 0b110: // Sector 4: (1,1,0)  240-300 degrees
            ppwmL=(int*)&PDC1; ppwmH=(int*)&PDC2; ppwm0=(int*)&PDC3; break;

        case 0b100: // Sector 5: (1,0,0)  300-360 degrees
            ppwmL=(int*)&PDC1; ppwm0=(int*)&PDC2; ppwmH=(int*)&PDC3; break;

        case 0b101: // Sector 6: (1,0,1)    0- 60 degrees
            ppwm0=(int*)&PDC1; ppwmL=(int*)&PDC2; ppwmH=(int*)&PDC3; break;
        }
    }

    pwmH = CtrlReferences.qIqRef >> 6;

    if (pwmH>125) pwmH=125; else if (pwmH<-125) pwmH=-125;

    pwmL = pwmH;  
  }
  else if (SysStatus.TorqueControl)
  {
    static int KiErrIntH=0,KiErrIntL=0;

    int Err;

