robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
    if (encoder_dhes_state_stored != encoder_dhes_state)
    {
        encoder_dhes_state_stored  = encoder_dhes_state;

        KiErrIntH=KiErrIntL=0;

        switch (encoder_dhes_state)
        {
        case 0b001: // Sector 1: (0,0,1)   60-120 degrees
            piH=(int*)&(ParkParm.qIa); piL=(int*)&(ParkParm.qIb); 
            ppwmH=(int*)&PDC1; ppwmL=(int*)&PDC2; ppwm0=(int*)&PDC3; break;

        case 0b011: // Sector 2: (0,1,1)  120-180 degrees
            piH=(int*)&(ParkParm.qIa); piL=(int*)&(ParkParm.qIc);
            ppwmH=(int*)&PDC1; ppwm0=(int*)&PDC2; ppwmL=(int*)&PDC3; break;

        case 0b010: // Sector 3: (0,1,0)  180-240 degrees
            piH=(int*)&(ParkParm.qIb); piL=(int*)&(ParkParm.qIc);
            ppwm0=(int*)&PDC1; ppwmH=(int*)&PDC2; ppwmL=(int*)&PDC3; break;

        case 0b110: // Sector 4: (1,1,0)  240-300 degrees
            piH=(int*)&(ParkParm.qIb); piL=(int*)&(ParkParm.qIa);
            ppwmL=(int*)&PDC1; ppwmH=(int*)&PDC2; ppwm0=(int*)&PDC3; break;

        case 0b100: // Sector 5: (1,0,0)  300-360 degrees
            piH=(int*)&(ParkParm.qIc); piL=(int*)&(ParkParm.qIa);
            ppwmL=(int*)&PDC1; ppwm0=(int*)&PDC2; ppwmH=(int*)&PDC3; break;

        case 0b101: // Sector 6: (1,0,1)    0- 60 degrees
            piH=(int*)&(ParkParm.qIc); piL=(int*)&(ParkParm.qIb);
            ppwm0=(int*)&PDC1; ppwmL=(int*)&PDC2; ppwmH=(int*)&PDC3; break;
        }

        iHfilt = *piH;
        iLfilt = *piL;
    }

    //////////////////////////////////////////////////////

    iHfilt += *piH;
    iHfilt >>= 1;

    Err = CtrlReferences.qIqRef - iHfilt;

    pwmH = __builtin_mulss(CurrentQPID.IDPMCoefficients[2], Err) >> (16+KSHIFT_Q_P);

    KiErrIntH += __builtin_mulss(CurrentQPID.IDPMCoefficients[0], Err) >> 8;

    if (KiErrIntH > CurrentQPID.IDPMCoefficients[3])
    {
        KiErrIntH = CurrentQPID.IDPMCoefficients[3];        
    }
    else if (KiErrIntH < -CurrentQPID.IDPMCoefficients[3])
    {
       KiErrIntH = -CurrentQPID.IDPMCoefficients[3];        
    }
      
    pwmH += KiErrIntH >> 8;

    if (pwmH>125) pwmH=125; else if (pwmH<-125) pwmH=-125;

    //////////////////////////////////////////////////////

    iLfilt += *piL;
    iLfilt >>= 1;

    Err = CtrlReferences.qIqRef + iLfilt;

    pwmL = __builtin_mulss(CurrentQPID.IDPMCoefficients[2], Err) >> (16+KSHIFT_Q_P);

    KiErrIntL += __builtin_mulss(CurrentQPID.IDPMCoefficients[0], Err) >> 8;

    if (KiErrIntL > CurrentQPID.IDPMCoefficients[3])
    {
        KiErrIntL = CurrentQPID.IDPMCoefficients[3];        
    }
    else if (KiErrIntL < -CurrentQPID.IDPMCoefficients[3])
    {
        KiErrIntL = -CurrentQPID.IDPMCoefficients[3];        
    }
      
    pwmL += KiErrIntL >> 8;

    if (pwmL>125) pwmL=125; else if (pwmL<-125) pwmL=-125;
  }
  else
  {
      pwmH = pwmL = 0;
  }

  // if we are close enough to the PCD register shadow copy then wait until
  // its done before updating local PDCs
  // The condition will became false when the PWM is counting down but it is still
  // far from 0 or when it change direction counting up

  // reset the flag that indicates if the PWM registers update was delayed
  pwmdelay = 0;

  // reset timeout counter that is used to wait for the PWM registers update
  timeout = PWMSAFETIME;

  //     PWM count DN               PWM count < PWM_SAFE_TIME
  while((P1TMR & 0x8000) && ((P1TMR & 0x7fff) < PWMSAFETIME))
  {
      pwmdelay = 1;

      if(0==timeout--)
      {
        SysError.FirmwarePWMFatalError = 1;
        //FaultConditionsHandler();
        break;
      }
  }

  if(pwmdelay)
  {
    // if the PWM PDC update has been delayed, then increment
    // the counter that keeps track of this event, but be
    // careful not to overflow it
    if (FirmwarePWMTimingErrorCount < 0xff)
    {
        FirmwarePWMTimingErrorCount++;
    }
  }

  *ppwmH = pwm_half+pwmH;
  *ppwm0 = pwm_half;
  *ppwmL = pwm_half-pwmL;
 
  // when gulp_update_request is == 1, the main loop will not access those vars. 
  if(1 == gulp_update_request)
  {  
    // GULP!ed variables
    //Gulp.W[0] = CtrlReferences.qIqRef; //*gulpadr1;
    //Gulp.W[1] = ParkParm.qIa; //*gulpadr2;
    //Gulp.W[2] = ParkParm.qIb; //*gulpadr3;
    //Gulp.W[3] = ParkParm.qIc; //*gulpadr4;

    Gulp.W[0] = *gulpadr1;
    Gulp.W[1] = *gulpadr2;
    Gulp.W[2] = *gulpadr3;
    Gulp.W[3] = *gulpadr4;
    
    // unlock the main loop, so it will read values just updated
    gulp_update_request = 0;

    // read VDC link raw value;
    VDCLink = ADCGetVDCLink();
    debug_i2t = I2Tdata.Acc[1];
  }

  // perform I2T protection from ParkParm.qId,qIq 
  //I2Tdata.IQMeasured = /*abs*/(ParkParm.qIq);
  //I2Tdata.IDMeasured = /*abs*/(ParkParm.qId);

  I2Tdata.IQMeasured = I2Tdata.IDMeasured = ParkParm.qIa;
  I2Tdata.IQMeasured += ParkParm.qIb;
  I2Tdata.IQMeasured += ParkParm.qIb;
  I2Tdata.IQMeasured *= 10;
  I2Tdata.IQMeasured >>= 4;

  // Invoke the I2T integrator with new current values
  if(I2T(&I2Tdata))
  {
    //The I2T grew too much. Protect!
    SysError.I2TFailure = 1;
    FaultConditionsHandler();
  }

  //Clear the DMA0 Interrupt Flag
  IFS0bits.DMA0IF = 0;
}

#else

void __attribute__((__interrupt__,no_auto_psv)) _DMA0Interrupt(void)
//
// DMA0 IRQ Service Routine
// used for FOC loop
//
{
  int pwmdelay = 0;
  int timeout;
  static int W_PID_Undersample= W_PID_UNDERSAMPLE;


//DEADCATS: inizializzando idx con qualsiasi valore il controllo di velocita
//  'grattava' in una direzione.
//  E' stata individuata la causa: la coincidenza tra il reload del contatore PWM e l`aggiornamento
//  dei valori da parte del SVG quando vengono usati encoder spi.
//  per evitare tutto cio l'irq FOC deve terminare PRIMA della meta' della PWM!!!
//   |\      _,,,---,,_
//   /,`.-'`'    -.  ;-;;,_
//  |,4-  ) )-,_..;\ (  `'-'
// '-  ''(_/--'  `-'\_)
//  Per questa cosa e' stato implementato un workaround: Nel caso in cui si preveda
//  che i registri stiano per essere aggiornati nel momento sbagliato, il loro
//  aggiornamento viene leggermente ritardato fino ad oltre il momento critico.
//  In questo modo se il loop FOC dovesse durare piu di meta PWM abbiamo un jitter
//  (i valori PWM vengono settati per il giro dopo) ma almeno non si inchioda tutto.
//  Questa condizione e' comunque segnalata tramite flag di errore e sarebbe meglio
//  che non si verificasse...
//

