robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
#ifdef PIN_RA3_IS_DEBUG
  // debug pin
  PORTAbits.RA3 = 1;
#endif

  // This ISR is *very* high priority.
  // It might preempt lower priority ASM DSP code.
  // Above we make it sure that the preempted code can continue
  // safely when this ISR finishes. Here we ensure that THIS
  // ISR (that will use DSP ASM funtions) can work properly, and
  // so we set the CORCON register in proper way.

  // setting CORCON in this way rather than using CORCONbits is
  //slightly more efficient (because CORCONbits is volatile and
  // optimizer cannot collapse multiple bit operations)
    CORCON = (1<<2) | // PSV for const data
             (1<<4) | // enable super saturation
             (1<<5) | // enable saturation on DSP write to mem
             (1<<6) | // enable saturation on DSP accumulator B
             (1<<7);  // enable saturation on DSP accumulator A
                      // conventional rounding mode (bit 1 set to 0)
                      // fractional multiplier (bit 0 set to 0)
                      // multiplier is signed (bit 12 set to 0)

  // read Meccanical postion [-1..0.9999] and angle corrected with encsyncpulsepos
  // calculate AlignedMecchanicalAngle and UnalignedMecchanicalAngle from raw encoder data
  EncoderPosition();

  // Trigger encoder. Start to prepare data for the next reading (if needed..)
  // this for ABS encoder make SPI to initiate transfer.
  EncoderTriggerSample();

#ifdef SAMPLE_IA_IB
  // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb
  // scale currents by MeasCurrParm.qKa, qKb
  // qIc is not calculated for better performance
  MeasAndCompIaIb();
  // TODO: si, si, tutto bello ma non funziona....
#else
  // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb, Offsetc
  // scale currents by MeasCurrParm.qKa, qKb, qKc
  // Calculate ParkParm.qIa, qIb, qIc
  MeasAndCompIaIcCalculateIb();
#endif

  if (1 == SysStatus.OpenLoop)
  // For openloop movment measured qAngle, is overridden.
  // increase ParkParm.qAngle to change rotation speed ramping up from zero.
  // Id and Iq are imposed constants
  {
    static unsigned int cnt = 0;
    static unsigned int DeltaTheta=OL_MIN_DELTA_THETA;

    // force the angle increase
    if((cnt % OPENLOOP_DEGRADATION) == 0)
    {
		  ParkParm.qAngle = OpenloopAngle;
    }

    // rotate mag field by DeltaTheta angle
    OpenloopAngle += DeltaTheta;

    // increase slope counter that causes the DeltaTheta to ramp up
    cnt++;

    if( (cnt > OL_RAMP_SLOPE) && (DeltaTheta < OL_MAX_DELTA_THETA))
    {
      DeltaTheta++;
      cnt = 0;
    }
  }
  else // Closed Loop (torque, speed, position)
  {
    // Using QE the starting phase must be allineated with the maximum of the flux.
    // this is done in open loop mode making a complete swap of mechanical angle
    // to drag the rotor from angle 0x01 to 0xFFFF
    // If the encoder is provided with a Index than align to the Index!
    // for absolute encoders (HES and AS504x) no movment is performed
    if(1 == SysStatus.InitialRotorAlignmentInProgress)
    {
      // Rotor alignment is done spinning the field for a complete mechanical
      // turn and dragging the rotor in position.
      AlignRotor();
    }
    else
    {

      // Rotor alignment completed start normal control loops

    //  Current_position =  AlignedMecchanicalAngle;

      // get velocity measurement from encoder registers
#ifdef TLE_INTERNAL_SPEED
      // Attentione!!!!:
      // la lettura di velocita' deriva nel caso dell'encoder tle dalla lettura della
      // posizione, calcolo CRC e accettazione dato  NON deve essere spostata dal loop FOC
      // in quanto deve completarsi entro il ciclo.
      tle_speed = EncoderVelocity();
#else
     // TODO: il calcolo della valocita` fatto oldstyle va infilato
     // in alternativa in questo ramo ifdef

     // Use FW calculated speed
     // ....
#endif


// TODO: what happen if even the 32 bit counter overflows?

      // detects and count complete rounds.
      if((unsigned int)AlignedMecchanicalAngle  > POSITION_TURN_DETECT_THRESHOLD && Previous_position < 65535-POSITION_TURN_DETECT_THRESHOLD)
      {
       // the position was close to its min and now it is jumped near to its max value. Decrease turns counter

        Turns--;
      }
      else
      {

        if((unsigned int)AlignedMecchanicalAngle < 65535-POSITION_TURN_DETECT_THRESHOLD &&  Previous_position > POSITION_TURN_DETECT_THRESHOLD)
        {

          // the position was close to its max and now it is jumped near to its min value. Increase turns counter
          Turns++;
        }
      }

      Previous_position = AlignedMecchanicalAngle;

      // Compose the final Current_position var by merging lower word and hiword with
      // encoder value (normalized to 16bits) and turns counter

      Current_position = (unsigned int)AlignedMecchanicalAngle;
      Current_position += ((long)Turns)* 0x10000;



#ifdef COMPLEX_VELOCITY_CALCULATION
      // TODO: comment please
      //
      // for complex velocity calculation algorithm
      //
      // TODO: la verifica dello speedundersampler peggiora le prestazioni del jitter del looop foc!
      //   tantovale farlo ad ogni ciclo!
      //      if(speed_undersample++ == VELOCITY_CALCULATION_UNDERSAMPLE)
      {
        int idx;

        // speed_undersample = 0;
        // increment index for velocity calculation ring buffer
        idx = (VelocityParm.positions_buffer_index+1) % POSITIONS_BUFFER_NUM;
        // fill the ring buffer for velocity calculation
        VelocityParm.positions_buffer[idx] = (position);
        // never write VelocityParm.positions_buffer_index before filled that location
        VelocityParm.positions_buffer_index = idx;
      }
#else
      // simple velocity calculation method no buffering used
      // only current position and last position stored at the previous speed cycle
      {
        if(speed_undersampler++ == W_SIMPLE_CALCULATION_UNDERSAMPLE)
        // The speed calculation is done only 1 time every
        // W_SIMPLE_CALCULATION_UNDERSAMPLE foc loop iterations
        {

