robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
          long tmp = Current_position - Previous_position_for_velocity_calc;

          // generic division has been changed with more efficient ASM division.
          // performance increment is huge.
          //VelocityParm.Velocity /= W_SIMPLE_CALCULATION_DIVISOR ;
          VelocityParm.Velocity = __builtin_divsd(tmp,W_SIMPLE_CALCULATION_DIVISOR);

          Previous_position_for_velocity_calc = Current_position;
          speed_undersampler = 0;


        }
      }
#endif

#ifdef COMP_POSITION_READ_DELAY
      // using SPI encoders the (fixed) time needed for data communication
      // can be taken in account and compensated.
      // the angle read from SPI is corrected taking in account the rotor speed
      // and the communication speed
      {
        int encoder_delay_correction;
        // compensate for encoder delay.
        // This avoids unwanted flux disalignment when speeding up..
        // TODO: how the mplam c30 compiles the double operation? Check for algo
        // complexity and eventually change (fixed point, MPY etc)
        encoder_delay_correction = ((double)VelocityParm.last_velocity * ENCODER_DELAY);
        //TODO: ENCODER_DELAY deve essere inizializzato in funzione del tipo di encoder definito in userparams!!!

        // read Meccanical postion,calculate electrical position in ParkParm.qAngle

        ParkParm.qAngle =  (AlignedMecchanicalAngle + encoder_delay_correction) * NPOLEPAIRS;

      }
#else
  // do not compensate position delay
      // TODO: portare dentro, oppure fare una ElectricalPosition()
      // read Meccanical postion,calculate electrical position in ParkParm.qAngle
      ParkParm.qAngle =  AlignedMecchanicalAngle * NPOLEPAIRS;

#endif
    }
  }
  // per fare un cambio al volo tra encoder e sonde di hall:
  // mettere un encoder assoluto e scommentare
  //
  // void ForceHESEmulation();

  // Calculate ParkParm.qSin,qCos from ParkParm.qAngle
  SinCos();

  // Calculate ParkParm.qId,qIq (and ParkParm.qIalpha,qIbeta) from ParkParm.qSin,qCos,qIa,qIb
  ClarkePark();

  // perform Torque Sensored Control Loop
  if(1 == SysStatus.TorqueSensorLoop)
  {
    // check if the zero torque from the sensor has been calibrated
    // the name of the variable is extremly misleading but...
    if(1 == SysStatus.LoopRunning)
    {
      // TODO: rimuovere l'undersampler
      if ( ASCounter == 1)
      {
        // set elaborated torque as torque reference
        CtrlReferences.qIqRef = Torque;
        ASCounter=TorcAndersempling;
      }
      else
      {
        ASCounter--;
      }
    }
  }

  // If we are in speed control then we must run the omega PID every
  // W_PID_UNDERSAMPLE 2foc cycles.
  // Decrease W_PID_Undersample counter until it reaches zero
  if((1 == SysStatus.SpeedControl) && (0 == W_PID_Undersample--))
  {
    // do velocity control loop
    // calculate ICtrlParm.qIdRef from current velocity and PID parameters
    W_PID_Undersample = W_PID_UNDERSAMPLE;
    // run speed loop PID calculate CtrlReferences.qIqRef from VelocityParm.last_velocity,
    //   CtrlReferences.qWRef and PID parameters

    OmegaControl();


    // per il loop di controllo in assembler
    // CtrlReferences.qIqRef = PIParmW.qOut;
  }

  // Calculate ParkParm.Vd,Vq control values from ParkParm.qId,qIq and ICtrlParm.qIdRef,qIqRef
  IdIqControl();

  if (1 == SysStatus.OpenLoop)
  // For openloop movment calculated values for qVd, qVq are overridden
  {
    // Override Vd and Vq for open loop operation (deflux)
    ParkParm.qVd = IRA_VD; // 0;
    // force a value for Vq (controls Iq = torque)
    ParkParm.qVq = IRA_VQ;
  }

  if ( 1 == SysStatus.InitialRotorAlignmentInProgress )
  // For Initial Rotor Alignment calculated values for qVd, qVq are overridden
  {
    // Override Vd and Vq for open loop operation (deflux)
    ParkParm.qVd = IraqVd; // 0;
    // force a value for Vq (controls Iq = torque)
    ParkParm.qVq = IraqVq;
  }

  // Calculate ParkParm.qValpha,qVbeta from ParkParm.qSin,qCos,qVd,qVq
  InvPark();
  // Calculate SVGenParm.Vr1,Vr2,Vr3 from ParkParm.qValpha,qVbeta (InvClarke())


  CalcRefVec();

  // reset the flag that indicates if the PWM registers update was delayed
  pwmdelay =0;

  // reset timeout counter that is used to wait for the PWM registers update
  timeout = PWMSAFETIME;

  // if we are close enough to the PCD register shadow copy then wait until
  // its done before updating local PDCs
  // The condition will became false when the PWM is counting down but it is still
  // far from 0 or when it change direction counting up

  //      PWM count DN           PWM count < PWM_SAFE_TIME
  while((P1TMR & 0x8000) && ((P1TMR & 0x7fff) < PWMSAFETIME))
  {
	  pwmdelay = 1;
	  if(0==timeout--)
    {
		  SysError.FirmwarePWMFatalError = 1;
		  break;
    }
  }

  if(pwmdelay)
  {
    // if the PWM PDC update has been delayed, then increment
    // the counter that keeps track of this event, but be
    // careful not to overflow it
	  if(FirmwarePWMTimingErrorCount < 0xff)
    {
		  FirmwarePWMTimingErrorCount++;
    }
  }


  // Calculate and set PWM duty cycles (PDC1, PDC2, PDC3) from SVGenParm.Vr1,Vr2,Vr3
  CalcSVGen();

  // when gulp_update_request is == 1, the main loop will not access those vars.
  if(1 == gulp_update_request)
  {
    // GULP!ed variables
    Gulp.W[0] = *gulpadr1;
    Gulp.W[1] = *gulpadr2;
    Gulp.W[2] = *gulpadr3;
    Gulp.W[3] = *gulpadr4;

    //Gulp.DW[1] = Current_position;

    // Draw Hall effect angle
    // DrawHallEffectAngle();

    // unlock the main loop, so it will read values just updated
    gulp_update_request = 0;

    // read VDC link raw value;
    VDCLink = ADCGetVDCLink();
  }


  // perform I2T protection from ParkParm.qId,qIq
  I2Tdata.IQMeasured = /*abs*/(ParkParm.qIq);
  I2Tdata.IDMeasured = /*abs*/(ParkParm.qId);

  // Invoke the I2T integrator with new current values
  if(I2T(&I2Tdata))
  {
    //The I2T grew too much. Protect!
    SysError.I2TFailure = 1;
    FaultConditionsHandler();
  }

  // TODO: comment or remove please
  debug_i2t= I2Tdata.Acc[1];


 GulpHistoryBuffer[GulpHistoryBufferIdx].W[0] = *gulpadr1;
 GulpHistoryBuffer[GulpHistoryBufferIdx].W[1] = *gulpadr2;
 GulpHistoryBuffer[GulpHistoryBufferIdx].W[2] = *gulpadr3;
 GulpHistoryBuffer[GulpHistoryBufferIdx].W[3] = *gulpadr4;
 GulpHistoryBufferIdx++;
 GulpHistoryBufferIdx &=  GULP_HISTORY_BUFFER_MASK;

