robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
#ifdef PIN_RA3_IS_DEBUG
  // debug pin
  PORTAbits.RA3 = 0;
#endif


 if(position_limits_enabled){
   if(Current_position < position_limit_lower){
    SysError.PositionLimitLower = 1;
    FaultConditionsHandler();
   }else if(Current_position > position_limit_upper){
    SysError.PositionLimitUpper = 1;
    FaultConditionsHandler();
   }
 }

  //Clear the DMA0 Interrupt Flag
  IFS0bits.DMA0IF = 0;


}

#endif

void SiliconRevionTest()
// checks for proper silicon revision
{
  unsigned int devrev;
  
  // read silicon chip revision
  _memcpy_p2d16(&devrev, 0xff0002, sizeof(devrev));

  if(devrev != 0x3003)
  {

	// TODO: trigger fault really ?
	
    SysError.SiliconRevisionFault = 1;
  }
}

void EMUROMTestCRC()
// EMUROM CRC checks 
{
  // TODO: giustappunto.
  SysError.EMUROMCRCFault = 0;
}

void EncoderSelfTest()
// encoder selftest (when possible)
{
  // TODO: giustappunto.
  SysError.EncoderFault = 0;
}

void ADCDoOffsetTest()
// ADC Offset test
{
  // TODO: giustappunto.
  // A questo punto la calibrazioni e stata fatta
  // Se e' fallita e noi qui resettiamo il flag allora
  // non sapremo mai se e' fallita!!
  // SysError.ADCCalFailure = 0;
}

void ZeroControlReferences()
// zero control set-point
{
  // disable toggling references
  TogglingEnable = 0;
  OmegaTogglingReference = Q15(0.0);
  TorqueTogglingReference = Q15(0.0);

  // Id (flux) Iq (torque) reference values 
  CtrlReferences.qIdRef = Q15(0.0);
  // this parameter controls the startup torque reference
  CtrlReferences.qIqRef = Q15(0.0);

  // Omega setpoint
  CtrlReferences.qWRef = Q15(0.0);

  // TODO: zero position and sensored torque references 
}

void DriveInit()
// Perform drive HW init
{
  // Reset all system error flags
  memset(SysError.b,0,sizeof(SysError));

  // Avoid leaving any random garbage in SysStatus
  memset(SysStatus.b, 0, sizeof(SysStatus));

  // IIR filters initialization
  iirt.numSectionsLess1 = 2;  // Nbq - 1
  iirt.coeffsBase = &IirTransposedCoefs[0];
  iirt.coeffsPage = COEFFS_IN_DATA;
  iirt.delayBase1 = &IirTransposedState1[0];
  iirt.delayBase2 = &IirTransposedState2[0];
  iirt.finalShift = 0;
  // Zero the filter state
  IIRTransposedInit(&iirt);

  I2TInit(&I2Tdata);
  I2Tdata.Acc[0]=0;
  I2Tdata.Acc[1]=0;
  I2Tdata.Acc[2]=0;
  
  // setup for a center aigned PWM
  SetupPWM();

  // setup and perform ADC offset calibration in MeasCurrParm.Offseta and Offsetb 
  ADCDoOffsetCalibration();

  // Enable DMA interrupt, arm DMA for transfer
  ADCConfigPWMandDMAMode();

  // setup the position sensor
  EncoderInit();

  // init total number of turns
  Turns = 0;

  // initialize parameters for velocity calculation
  // encodersyncpulseposition is set to 0
  // so the position buffer must be initialized with the initial position of the encoder 
  VelocityInit();

  // Setup timer for velocity calculation and velocity control loop
  Timer2Config();

  // Setup timer for CAN periodic send
  Timer4Config();

  // setup Hw related parameters (current gain, ecc...)
  SetupHWParameters();

  // init PIDs and references
  SetupControlParameters(); 

  // define default control strategy *only*one*can*be*activated* 
  SysStatus.OpenLoop = 1;
  //SysStatus.TorqueControl = 1;
  //SysStatus.TorqueSensorLoop = 1;
  //SysStatus.SpeedControl = 1;
  //SysStatus.PositionControl = 1;

  // zero control set-point
  ZeroControlReferences();

  // Enables the external fault (pushbutton) interrupt
  // conditioned to PIN_RA3_IS_DEBUG
  ExternalFaultEnable();

  // load eeprom data
  EepromLoad();
}

void DriveSelfTest()
// Perform drive HW selftest
{
  // Check silicon revion
  SiliconRevionTest();

  // Selftest EMUROM
  EMUROMTestCRC();

  // Selftest EMUROM
  EncoderSelfTest();

  // Test ADC offset 
  ADCDoOffsetTest();
  
  // TODO: vedere se possibile verificare l'oscillatore e la verifica di porte di IO
}

void ApplyBrake()
// 2FOC doesn't have a brake unit
//TODO: if we want to keep this stub, then we should add some other
//stub to release brake!
{
}

void ApplyVDCLink()
// 2FOC doesn't have a switchable VDCLink
{
  DS402_Statusword.Flags.VoltageEnabled = 1;
}

void RemoveVDCLink()
// 2FOC doesn't have a switchable VDCLink
{
  DS402_Statusword.Flags.VoltageEnabled = 0;
}

void DisableDrive()
// disable the drive functions:
// - disable and zero control reference and status
// - disable PWM generators
// - disable FOC loop
{
  // disable PWM
  PWMDisable();
  // I2T Will run in behalf of timer 3 when 2FOC loop is not active
  EnableIntT3;

  // Disable ADC IRQ and DMA
  ADCInterruptAndDMADisable();

  // zero torque and speed referemces
  ZeroControlReferences();
  // Zero regulators
  ZeroRegulators();
}

int main ( void )
// 
// drive functions are controlled according to DS402 standard (when possible)
// 
{
    eEbasicstrg_res_t eE_res;
    uint32_t boardCanAddr;

/*
 * MOVED OFF notreadytoswitchon to enable LED operation in notreadytoswitchon state
 */

  // Configure Oscillator Clock Source, PLL
  oscConfig();
 
  // set up port direction and peripheral pin mapping
  SetupPorts();

  // Interrupt Priority configuration
  InterruptPriorityConfig();

  // enable change notification INT.
  // this is shared for external fault and
  // QEP homing when zero signal is used in interrupt mode.
  IEC1bits.CNIE = 1;

  // Setup timer for low frequency (LED) operations
  Timer1Config();
  // Setup timer for I2T (when 2foc loop is not running)
  Timer3Config();
  // enable timer1 interrupt
  EnableIntT1;
/*
 * END MOVED OFF notreadytoswitchon to enable LED operation in notreadytoswitchon state
 */

//VALE
  ee_basicstrg_init();
 
notrreadytoswitchon:
  // DS402 State xxxx xxxx x0xx 0000 NOT READY TO SWITCH ON:  
  // Logic power has been applied to the drive. The drive is being initialized or is running self test.
  // A brake, if present, has to be applied in this state. The drive function is disabled.

  // already initialized as NOT READY TO SWITCH ON:
  // DS402_Statusword.Flags.ReadyToSwitchOn = 0;

  // start:
  //   DS402SM.statusword = DS402_START;

  // • State Transition 0: START => NOT READY TO SWITCH ON
  //   Event: unconditional.
  //   Action: The drive self-tests and/or self-initializes.

  // if available apply braking  
  ApplyBrake();
 
  // signal NOT READY TO SWITCH ON status with green LED blinking ultrafast
  // LED blinking velocity
  LED_status.GreenBlinkRate=BLINKRATE_ULTRAFAST;

  // Drive Init  
  DriveInit();

  // Drive selftest
  DriveSelfTest();

