robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
  // Test error flags and if everything is OK change status  
  if(Fault())
  {
    // at this stage the error is unrecoverable and communication isn't on yet 
    // so signal with led (red ON green Blinking madly)
    LED_status.RedBlinkRate=BLINKRATE_STILL;

    // retry the init/selftest phase
    goto notrreadytoswitchon;
  }
   
  LED_status.RedBlinkRate=BLINKRATE_OFF;
  // • State Transition 1: NOT READY TO SWITCH ON => SWITCH ON DISABLED
  //   Event: The drive has self-tested and initialized successfully.
  //   Action: Activate communication.

switchondisabled:
  // DS402 State xxxx xxxx x1xx 0000 SWITCH ON DISABLED:
  // Drive initialization is complete, the drive parameters have been set up.
  // Drive parameters may be changed. High voltage may not be applied to the drive, 
  // (2FOC cannot be completely DS402 compliant 'couse doesn't have 
  //  separate logic/power supplies). The drive function is disabled.

  // update status
  DS402_Statusword.Flags.SwitchOnDisabled = 1;
  DS402_Statusword.Flags.ReadyToSwitchOn = 0;
  DS402_Statusword.Flags.SwitchedOn = 0;
  DS402_Statusword.Flags.OperationEnabled = 0;

  // LED blinking velocity
  LED_status.GreenBlinkRate=BLINKRATE_ULTRAFAST;
//VALE  
//  CanIcubProtoInit(ApplicationData.EepromHeader.EE_CAN_BoardAddress);
    eE_res = ee_basicstrg_canaddress_get(&boardCanAddr);
    if(ee_basicstrg_res_ok !=eE_res)
    {
        //should never happen!!!
        boardCanAddr = BOARD_CAN_ADDR_DEFAULT;   
    }
    CanIcubProtoInit(boardCanAddr);
  
// TODO: verificare la corretta inizializzazione della comunicazione e 
//   nel caso non cambiare stato ma segnalare con i led
  if(0) // TODO: il CAN e' su?
  {
    // at this stage the error is unrecoverable and communication isn't on yet 
    // so signal with led (red ON green Blinking madly)
    LED_status.RedBlinkRate=BLINKRATE_FAST;

    // retry the CAN initializzation
    goto switchondisabled;
  }

  // • State Transition 2: SWITCH ON DISABLED => READY TO SWITCH ON
  // Event: Communiction activated or 'Shutdown' command received from host.
  // Action: None

readytoswitchon:
  // DS402 State xxxx xxxx x01x 0001 READY TO SWITCH ON:
  // High voltage may be applied to the drive. The drive parameters may be changed.
  // The drive function is disabled.

  // update status
  DS402_Statusword.Flags.SwitchOnDisabled = 0;
  DS402_Statusword.Flags.ReadyToSwitchOn = 1;
  DS402_Statusword.Flags.SwitchedOn = 0;
  DS402_Statusword.Flags.OperationEnabled = 0;
 
  // LED blinking velocity
  LED_status.GreenBlinkRate=BLINKRATE_FAST;

  DS402_Controlword.Flags.SwitchOn = 0;
  DS402_Controlword.Flags.EnableVoltage = 0;
  DS402_Controlword.Flags.EnableOperation = 0;
  //VALE: now the application strat to transmit status msg
  EnableIntT4;
  // Stays in READY TO SWITCH ON until the command 
  // SwitchOn received from CAN
  while( 0 == DS402_Controlword.Flags.SwitchOn )
  { 
    if (!Fault()) LED_status.GreenBlinkRate=BLINKRATE_FAST; 
  }

  // • State Transition 3: READY TO SWITCH ON => SWITCHED ON
  // Event: 'Switch On' command received.
  // Action: The power section is switched on if it is not already switched on.

switchedon:
  // DS402 Status xxxx xxxx x01x 0011 SWITCHED ON:
  // High voltage has been applied to the drive. The power amplifier is ready.
  // The drive parameters may be changed. The drive function is disabled.

  // update status
  DS402_Statusword.Flags.SwitchOnDisabled = 0;
  DS402_Statusword.Flags.ReadyToSwitchOn = 0;
  DS402_Statusword.Flags.SwitchedOn = 1;
  DS402_Statusword.Flags.OperationEnabled = 0;

  LED_status.GreenBlinkRate=BLINKRATE_NORMAL;

  // (fake) enable VDCLink
  ApplyVDCLink();
  DS402_Controlword.Flags.EnableVoltage = 1;

  // Stays in SWITCHED ON until the command 
  // EnableOperation or Shutdown received from CAN
  // TODO: conform coding style
  while(1){

    // TODO: conform coding style
    // TODO: comment please
  	while( (0 == DS402_Controlword.Flags.EnableOperation) && (1 == DS402_Controlword.Flags.EnableVoltage) )
    { 
      if (!Fault()) LED_status.GreenBlinkRate=BLINKRATE_NORMAL; 
    }

    // TODO: comment please
  	if (0 == DS402_Controlword.Flags.EnableVoltage)
  	{
      // • State Transition 6: SWITCHED ON => READY TO SWITCH ON
      // Event: 'Shutdown' command received from host.
      // Action: The power section is switched off.
      DS402_Controlword.Flags.SwitchOn = 0;

      // reset the DC link reading to a good value:
      // it will be overwritten with actual value as soon
      // as the first measurement will be ready.
      DCLinkReset();

      // reset faults
      FaultReset();

      goto readytoswitchon;
    }

    // do not switch to operational until dclink is ok
    if( 0 != SysError.OverVoltageFailure || 0 != SysError.UnderVoltageFailure) 
    { 
      continue;
    }
 
    // do not switch to operational until emergency button is pressed!
    if( ExternaFaultIsAsserted() )
    {
		 FaultExternalTriggered();
		 continue;
    }

    // do not switch to operational until the overcurrent fault has been cleared (shutdown)
    if( 0 != SysError.OverCurrentFailure)
    {
      continue;
    }
	  break;
  }
  // • State Transition 4: SWITCHED ON => OPERATION ENABLE
  // Event: 'Enable Operation' command received from host.
  // Action: The drive function is enabled.

//operationenabled:
  
  // DS402 Status xxxx xxxx x01x 0111 OPERATION ENABLE:
  // No faults have been detected. The drive function is enabled and power is applied to the motor.
  // The drive parameters may be changed. (This corresponds to normal operation of the drive.)

  // update status
  DS402_Statusword.Flags.SwitchOnDisabled = 0;
  DS402_Statusword.Flags.ReadyToSwitchOn = 0;
  DS402_Statusword.Flags.SwitchedOn = 0;
  DS402_Statusword.Flags.OperationEnabled = 1;

  LED_status.GreenBlinkRate=BLINKRATE_STILL;

/////////////////////////////////////////////////////////////////////////////////
// TODO: questa sezione di codice è fatta di merda.
//  
  // init variables for speed calc and current velocity to 0
  // get current position from encoder (some s.o.a.b. could have manually moved the axis while turned off!)
  EncoderTriggerSample(); 
  EncoderWaitUpdate(); 
  EncoderPosition();
  

