robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app/2FOC.c
  Current_position = (unsigned int)AlignedMecchanicalAngle;
  Current_position += ((long)Turns)* 0x10000;  
  Previous_position = AlignedMecchanicalAngle;
  
  Previous_position_for_velocity_calc = Current_position;
  
  // VelocityParm.Velocity = 0; 
  // speed_undersampler = VELOCITY_CALCULATION_UNDERSAMPLE-1;
  VelocityParm.Velocity =  Current_position-Previous_position_for_velocity_calc;
  Previous_position_for_velocity_calc = Current_position;
  speed_undersampler = 0;
#if 0
  CtrlReferences.qWRef = Q15(0.0);

  PIParmW.qdSum = 0;
  InitPI(&PIParmW);
#endif

  ZeroRegulators();

  // enable timer2 interrupt for speed calc
  EnableIntT2;

  // Arm all the automation (PWM->ADC->DMA->FOC) but don't start yet!
  ADCInterruptAndDMAEnable();
 
  // enable timer3 interrupt for CAN periodic send
//VALE: commented because we use T4 for transmission only when application is in idle
//#ifndef SYNC_2FOC_TO_EMS
//  EnableIntT4;
//#endif

  // if rotor is not aligned perform alignment (only once each turn on)
  if(0 == SysStatus.InitialRotorAlignmentComplete) 
  {
    // Align angle 0 with rotor flux maximum
    EncoderRotorAlign();
    // TODO: detect and signal a failed rotor alignment 
  }

  // TODO: enable overcurrent fault during rotor allignment
  // enable the overcurrent interrupt
  //OverCurrentFaultIntEnable();

  // I2T will run on behalf of 2FOC loop. Stop running it in behalf of Timer 3
  DisableIntT3;
  // Starts to pump current!
  PWMEnable();

  FaultRecheck();
  while(1)
  {
    // TODO: rimuovere le n variabili relative alla tensione
    DCLinkCheck();

    // • State Transition 5: OPERATION ENABLE => SWITCHED ON
    // Event: 'Disable Operation' command received from host.
    // Action: The drive operation will be disabled.

    if (0 == DS402_Controlword.Flags.EnableOperation)
    {
      // Disable drive functions  
      DisableDrive();
//VALE: enable T4 interrupt in order to send staus msg iven if controller is in idle
      // Stop periodic CAN communication
//      DisableIntT4;
//        EnableIntT4;    //this is not necessary becaouse IntT4 is already enabled   
      // change status
      // reset the DC link reading to a good value:
      // it will be overwritten with actual value as soon
      // as the first measurement will be ready.
      DCLinkReset();

      // reset faults
      FaultReset();
      //goto switchedon;
      goto switchedon;
    }

    // • State Transition 8: OPERATION ENABLE => READY TO SWITCH ON
    // Event: 'Shutdown' command received from host.
    // Action: The power section is switched off immediately, and the motor is free to rotate if
    // unbraked.

    if (0 == DS402_Controlword.Flags.EnableVoltage)
    {
      // Disable drive functions  
      DisableDrive();
//VALE: comment in order to send staus msg iven if controller is in idle
      // Stop periodic CAN communication
//      DisableIntT4;
	 
      // change status
      // reset the DC link reading to a good value:
      // it will be overwritten with actual value as soon
      // as the first measurement will be ready.
      DCLinkReset();

      // reset faults
      FaultReset();

      goto readytoswitchon;
    }

    // • State Transition 9: OPERATION ENABLE ? SWITCH ON DISABLED
    // Event: 'Disable Voltage' command received from host.
    // Action: The power section is switched off immediately, and the motor is free to rotate if
    // unbraked.
    // This status change is UNIMPLEMENTED for it has almost the same results as transiction 8
    // ( 2FOC board has no internal DCLink switch available!)  
  };
  
  // should never arrive here!
  while(1);

asm("NOP");
asm("NOP");
asm("NOP");
asm("NOP");
asm("NOP");

}

/*

• State Transition 7: READY TO SWITCH ON ? SWITCH ON DISABLED
Event: 'Quick Stop' and ‘Disable Voltage’ command received from host.
Action: None

• State Transition 10: SWITCHED ON ? SWITCH ON DISABLED
Event: 'Disable Voltage' or 'Quick Stop' command received from host.
Action: The power section is switched off immediatly, and the motor is free to rotate if
unbraked.
DEVICE CONTROL Drives and Motion Control CiA DSP 402 V 2.048

• State Transition 11: OPERATION ENABLE ? QUICK STOP ACTIVE
Event: 'Quick Stop' command received from host.
Action: The quick stop function is executed.

• State Transition 12: QUICK STOP ACTIVE ? SWITCH ON DISABLED
Event: 'Quick Stop' is completed or 'Disable Voltage' command received from host.
This transition is possible, if the Quick-Stop-Option-Code is different 5 (stay in the state ‘Quick
Stop Active’).
Action: The power section is switched off.

• State Transition 13: All states ? FAULT REACTION ACTIVE
A fault has occurred in the drive.
Action: Execute appropriate fault reaction.

• State Transition 14: FAULT REACTION ACTIVE ? FAULT
Event: The fault reaction is completed.
Action: The drive function is disabled. The power section may be switched off.

• State Transition 15: FAULT ? SWITCH ON DISABLED
Event: 'Fault Reset' command received from host.
Action: A reset of the fault condition is carried out if no fault exists currently on the drive.
After leaving the state Fault the Bit 'Fault Reset' of the controlword has to be cleared by the
host.

• State Transition 16: QUICK STOP ACTIVE ? OPERATION ENABLE
Event: 'Enable Operation' command received from host. This transition is possible if the
Quick-Stop-Option-Code is 5, 6, 7 or 8 (? Chapter 10.3.5).
Action: The drive function is enabled.
*/

